// GOP++

#include <iostream>

#define ярусский setlocale(LC_CTYPE, "Russian")
#define ану_иди_сюда using namespace
#define сказал std
#define типа {
#define епт }
#define нах ;
#define базарь cout <<
#define погрей_уши_про cin >>
#define эээ endl
#define естьсука ==
#define нихуяне !=
#define развести !
#define хульменьшечем <
#define заебииись >
#define если if (
#define то )
#define иначе else
#define э void
#define факт bool
#define раздватри int
#define бабки double
#define основа main()
#define накинуть +
#define отжать -
#define раскидать_на /
#define поднять_на *
#define и &&
#define или ||
#define иещоэто <<
#define иещето >>
#define это =
#define подкинь +=
#define жиза true
#define нихуя false
#define мель 0
#define чирик 10
#define косарь 1000
#define тянимазу_пока while(
#define есть )
#define быро ()
#define валим return
#define отседа 0

ану_иди_сюда сказал нах

э убирайЛохаСПенька быро типа
епт

раздватри основа типа
	ярусский нах

	факт семки это нихуя нах
	факт ужеДоебалсяПоСемкам это нихуя нах
	раздватри лопата это мель нах
	раздватри бабосы это мель нах

	базарь "Гони косарь, бля." иещоэто эээ нах
	базарь "Быстра, бля > " нах
	погрей_уши_про бабосы нах
	базарь эээ нах

	если бабосы хульменьшечем косарь то типа
		базарь "Хули тут так мало, еба?!" иещоэто эээ нах
		убирайЛохаСПенька быро нах
	епт
	иначе типа
		базарь "Нормас, пацанюра" иещоэто эээ нах
	епт

	лопата подкинь бабосы нах

	тянимазу_пока семки нихуяне жиза есть типа
		если ужеДоебалсяПоСемкам то типа
			базарь "Семки гони, блянах!!1!1" иещоэто эээ нах
		епт
		иначе типа
			базарь "А семки есть?" иещоэто эээ нах
		епт

		базарь "Говори, бля > " нах
		погрей_уши_про семки нах
		базарь эээ нах

		если ужеДоебалсяПоСемкам и семки естьсука жиза то типа
			базарь "Сразу так бы, ептыблять." иещоэто эээ нах
		епт
		иначе если семки естьсука жиза то типа
			базарь "ОООО, красава!" иещоэто эээ нах
		епт

		ужеДоебалсяПоСемкам это жиза нах
	епт

	валим отседа нах
епт
